In [29]:
import pandas as pd
data=pd.read_csv("pandas.csv")
data

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600
5           5    Kavya   25    3000
6           6   Monika   26    3200
7           7   Bhavya   22    1800
8           8   Manasa   30    2500

In [16]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  9 non-null      int64
 1   Name        9 non-null      object
 2   Age         9 non-null      int64
 3   Salary      9 non-null      int64
dtypes: int64(3), object(1)
memory usage: 416.0+ bytes

In [20]:
print(df.head(3))

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200

In [21]:
print(df.tail(3))

   Unnamed: 0    Name  Age  Salary
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [4]:
import pandas as pd
df=pd.read_csv("pandas.csv")
df[["Age","Name"]]

   Age     Name
0   18    Bhanu
1   17  Sravani
2   20     Rani
3   19   Pavani
4   16      Anu
5   25    Kavya
6   26   Monika
7   22   Bhavya
8   30   Manasa

In [35]:
df["Salary"]>2000

0    False
1    False
2     True
3    False
4    False
5     True
6     True
7    False
8     True
Name: Salary, dtype: bool

In [11]:
data["Age"].max()

30

In [12]:
data["Age"].min()

16

In [13]:
data["Name"].max()

'Sravani'

In [14]:
data["Name"].min()

'Anu'

In [45]:
df[df["Age"]>20]

   Unnamed: 0    Name  Age  Salary
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [40]:
df[df["Age"]>20]

   Unnamed: 0    Name  Age  Salary
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [50]:
df.Name.describe()

count         9
unique        9
top       Bhanu
freq          1
Name: Name, dtype: object

In [51]:
df.Age.describe()

count     9.000000
mean     21.444444
std       4.693376
min      16.000000
25%      18.000000
50%      20.000000
75%      25.000000
max      30.000000
Name: Age, dtype: float64

In [27]:
print(data.loc[6])

Unnamed: 0         6
Name          Monika
Age               26
Salary          3200
Name: 6, dtype: object

In [57]:
print(df.loc[[2,1]])

   Unnamed: 0     Name  Age  Salary
2           2     Rani   20    2200
1           1  Sravani   17    1200

In [64]:
df["Age"]>20

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
Name: Age, dtype: bool

In [69]:
df["Age"]=["1","2","3","4","5","6","7","8","9"]
df

   Unnamed: 0     Name Age  Salary
0           0    Bhanu   1    1500
1           1  Sravani   2    1200
2           2     Rani   3    2200
3           3   Pavani   4    1700
4           4      Anu   5    1600
5           5    Kavya   6    3000
6           6   Monika   7    3200
7           7   Bhavya   8    1800
8           8   Manasa   9    2500

In [40]:
data["Marks"]=0

In [41]:
data

   Unnamed: 0     Name  Age  Salary Adderess  Marks
0           0    Bhanu   18    1500        p      0
1           1  Sravani   17    1200        q      0
2           2     Rani   20    2200        r      0
3           3   Pavani   19    1700        s      0
4           4      Anu   16    1600        t      0
5           5    Kavya   25    3000        u      0
6           6   Monika   26    3200        v      0
7           7   Bhavya   22    1800        w      0
8           8   Manasa   30    2500        x      0

In [75]:
df["Name"][0,2]="Ammani"
print(df)

   Unnamed: 0     Name Age  Salary   Bhanu Teacher       0
0           0   Ammani   1    1500  Ammani  Ammani  Ammani
1           1  Sravani   2    1200  Ammani  Ammani  Ammani
2           2   Ammani   3    2200  Ammani  Ammani  Ammani
3           3   Pavani   4    1700  Ammani  Ammani  Ammani
4           4      Anu   5    1600  Ammani  Ammani  Ammani
5           5    Kavya   6    3000  Ammani  Ammani  Ammani
6           6   Monika   7    3200  Ammani  Ammani  Ammani
7           7   Bhavya   8    1800  Ammani  Ammani  Ammani
8           8   Manasa   9    2500  Ammani  Ammani  Ammani

C:\Users\Ammani\AppData\Local\Temp/ipykernel_10916/3846337116.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Name"][0,2]="Ammani"
C:\ProgramData\Anaconda3\a\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [45]:
data.loc[2,"Name"]

'Rani'

In [79]:
data=df[(df.Age>20)&&(df.Salary>1000)]
newdata

SyntaxError: invalid syntax (Temp/ipykernel_10916/513971583.py, line 1)

In [81]:
df["Name"]

0     Ammani
1    Sravani
2     Ammani
3     Pavani
4        Anu
5      Kavya
6     Monika
7     Bhavya
8     Manasa
Name: Name, dtype: object

In [87]:
df["Age"]

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Age, dtype: object

In [1]:
import pandas as pd
df=pd.read_csv("pandas.csv")
print(df)

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600
5           5    Kavya   25    3000
6           6   Monika   26    3200
7           7   Bhavya   22    1800
8           8   Manasa   30    2500

In [14]:
df{'age':["17","20","18"]
   'passings':["a", "b", "c"]}
df=pd.read_csv("pandas.csv")
print(df)

SyntaxError: invalid syntax (Temp/ipykernel_1480/2700596307.py, line 1)

In [10]:
df["age"]=["r","g","q","e","r","e","j","a","d"]
df

   Unnamed: 0     Name  Age  Salary age
0           0    Bhanu   18    1500   r
1           1  Sravani   17    1200   g
2           2     Rani   20    2200   q
3           3   Pavani   19    1700   e
4           4      Anu   16    1600   r
5           5    Kavya   25    3000   e
6           6   Monika   26    3200   j
7           7   Bhavya   22    1800   a
8           8   Manasa   30    2500   d

In [89]:
df.Age

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Age, dtype: object

In [18]:
import pandas as pd

mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pandas.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [91]:
import pandas as pd
print (pd.__version__)

1.3.4

In [24]:
import pandas as pd
print(pd.__version__)

1.3.4

In [28]:
import pandas as pd
a=[2,3,4]
df=pd.Series(a)
print(df)

0    2
1    3
2    4
dtype: int64

In [29]:
print(df[0])

2

In [31]:
print(data[0])

2

In [33]:
import pandas as pd
a=[1,2,3]
df=pd.Series(a,index=["x","y","z"])
print(df)

x    1
y    2
z    3
dtype: int64

In [35]:
print(df["x"])

1

In [37]:
import pandas as pd
dict={"a":1,"b":2,"c":3}
dict=pd.Series(dict)
print(dict)

a    1
b    2
c    3
dtype: int64

In [41]:
dict=pd.Series(dict,index=["a","b"])
dict

a    1
b    2
dtype: int64

In [54]:
import pandas as pd
data={
    "name":["a","b","c"],
    "age":[1, 2, 3]
}
df=pd.DataFrame(data)
print(df)

  name  age
0    a    1
1    b    2
2    c    3

In [67]:
import pandas as pd

data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

myvar = pd.DataFrame(data,index=["a","b","c"])

print(myvar)

   calories  duration
a       420        50
b       380        40
c       390        45

In [70]:
print(myvar.loc["a"])

calories    420
duration     50
Name: a, dtype: int64

In [73]:
print(df.max())

name    c
age     3
dtype: object

In [75]:
print(df.min())

name    a
age     1
dtype: object

In [3]:
import pandas as pd
df=pd.read_csv("pandas.csv")
print(df)

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600
5           5    Kavya   25    3000
6           6   Monika   26    3200
7           7   Bhavya   22    1800
8           8   Manasa   30    2500

In [4]:
print(df.head())

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600

In [6]:
print(df.head(7))

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600
5           5    Kavya   25    3000
6           6   Monika   26    3200

In [7]:
print(df.tail())

   Unnamed: 0    Name  Age  Salary
4           4     Anu   16    1600
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [10]:
print(df.tail(6))

   Unnamed: 0    Name  Age  Salary
3           3  Pavani   19    1700
4           4     Anu   16    1600
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [11]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  9 non-null      int64
 1   Name        9 non-null      object
 2   Age         9 non-null      int64
 3   Salary      9 non-null      int64
dtypes: int64(3), object(1)
memory usage: 416.0+ bytes
None

In [26]:
df[["Age","Salary"]]

   Age  Salary
0   18    1500
1   17    1200
2   20    2200
3   19    1700
4   16    1600
5   25    3000
6   26    3200
7   22    1800
8   30    2500

In [12]:
import random
x=random.randrange(1,60)
print(x)

45